[
  {
    "id": 1,
    "name": "Alexander Gerasimov",
    "photo": "alexander-gerasimov.jpg",
    "city": "Berlin, Germany",
    "intro": "<p>Alex is employed as a front-end engineer at Wix.com, earning just enough to sustain his functional programming addiction.</p><p>In his spare time he teaches programming and creates educational games with his hacker friends.</p>",
    "talk_lang": "EN",
    "talk_title": "Talk TBD",
    "talk_description": "",
    "twitter": "da_quirm"
  },
  {
    "id": 2,
    "name": "Andrei Lesnitsky",
    "photo": "andrei-lesnitsky.jpg",
    "city": "Minsk, Belarus",
    "intro": "<p>Andrei Lesnitsky - self-employed software dev. Passioned about front-end development, bleeding edge web-technologies, js performance, public speaking and knowledge sharing. Constantly experimenting with new stuff, messing around with pet projects for fun.</p>",
    "talk_lang": "EN",
    "talk_title": "Talk TBD",
    "talk_description": "",
    "twitter": "lesnitsky_a"
  },
  {
    "id": 3,
    "name": "Andre Gloukhmantchouk",
    "photo": "andre-gloukhmantchouk.jpg",
    "city": "Los Angeles, United States",
    "intro": "<p>Andre is Software Engineer at Google/YouTube monetization. Uses his spare time to keep up with ever-evolving Front End world. Loves snowboard, wakeboard, &lt;anything&gt;board.</p>",
    "talk_lang": "EN",
    "talk_title": "Talk TBD",
    "talk_description": "",
    "twitter": ""
  },
  {
    "id": 4,
    "name": "Martin Splitt",
    "photo": "martin-splitt.jpg",
    "city": "Zürich, Switzerland",
    "intro": "<p>Martin is open source contributor and web evangelist by heart from Zurich with a decade experience from the trenches of software engineering in multiple fields.</p><p>He works as a developer advocate at Google and loves solving problems.</p><p> He devotes his time to moving the web forward, fixing problems, building applications and systems and breaking things for fun & profit.</p><p> Martin believes in the web platform and is working with bleeding edge technologies that will allow the web to prosper.</p>",
    "talk_lang": "EN",
    "talk_title": "Talk TBD",
    "talk_description": "",
    "twitter": "g33konaut"
  },
  {
    "id": 5,
    "name": "Kirill Knysh",
    "photo": "kirill-knysh.jpg",
    "city": "Amsterdam, The Netherlands",
    "intro": "<p>Kirill Knysh, Engineer at EPAM Systems Amsterdam, 5+ years of experience of Set-Top-Box UI development, passionate to coding.</p>",
    "talk_lang": "EN",
    "talk_title": "Talk TBD",
    "talk_description": "",
    "twitter": ""
  },
  {
    "id": 6,
    "name": "Ilya Pukhalski",
    "photo": "ilya-pukhalski.jpg",
    "city": "Amsterdam, The Netherlands",
    "intro": "<p>Digital architect helping great brands launch not always great products. All-way JavaScript junkie, retired rock star, rym gat, beer drinker, hell raiser.</p>",
    "talk_lang": "EN",
    "talk_title": "Talk TBD",
    "talk_description": "",
    "twitter": "pukhalski"
  },
  {
    "id": 7,
    "name": "Martin Woolley",
    "photo": "martin-woolley.jpg",
    "city": "London, United Kingdom",
    "intro": "<p>Martin Woolley works for the Bluetooth SIG, the technical standards body for Bluetooth. He’s an industry veteran with over 30 years’ experience working with computers large, small and ….. getting smaller. He still has a Sinclair ZX81 somewhere.<p><p>Martin is the Bluetooth SIG's Developer Relations Manager for the EMEA region and is responsible for informing, educating and supporting developers in the region.</p>",
    "talk_lang": "EN",
    "talk_title": "Creating IoT Applications with Web Bluetooth",
    "talk_description": "<p>10 million Bluetooth devices ship every day, and that figure is rising. Regarded as one of the key, enabling technologies of the Internet of Things (IoT), Bluetooth is everywhere and in the summer of 2017, a new Bluetooth technology, Bluetooth mesh networking was released. Bluetooth mesh is used in enterprise and industrial IoT systems and in these environments, web technologies and cloud-based architectures are king. </p><p>Web Bluetooth allows developers to create web applications which can monitor and control Bluetooth devices. In this session, we’ll review key Bluetooth concepts and capabilities and the Web Bluetooth APIs which let you exploit them. </p><p>There may even be demos!</p>",
    "twitter": "bluetooth_mdw"
  },
  {
    "id": 8,
    "name": "Alexander Saft",
    "photo": "alexander-saft.jpg",
    "city": "Moscow, Russia",
    "intro": "<p>Alexander is a Software Engineer at Lifestream. Building lots of different APIs helped him to know the other side of work with vary RDBMS and gave him experience to become a sous chef of DBA. Now he is a usual fullstack developer who paints buttons, but with knowledge about transaction isolation levels and ways to get half of database with one query in milliseconds. Likes to take pictures and to talk about photography, especially lifestyle and still life.</p>",
    "talk_lang": "RU",
    "talk_title": "Workshop: ORM without ORM",
    "talk_description": "<p>Every backend developer faces with the need to work with database. Usually it’s RDBMS and usually it’s ORM. And it’s convenient and works fine. Until the queries become monstrous. Because RDBMS allow and encourage to write complex queries, but the ORMs… ORMs don’t like anything non-standard. And developer finds himself between the hammer and the anvil: he has to write clean and neat code and he has to utilize advanced DBMS features to reach good performance. So, is there any way to do what we need to do and not to suffer? At the workshop we will search and will find the way to write pretty code and get enthusiastic glance from your DBA.</p>",
    "twitter": "AlSaft"
  },
  {
    "id": 9,
    "name": "Timofey Lavrenuyk",
    "photo": "timofey-lavrenuyk.jpg",
    "city": "Odessa, Ukraine",
    "intro": "<p>Timofey is a Software Engineer at Keepsolid. Mozilla Tech Speaker. 6+ years in web development. Interested in creating my own projects, testing new features and going into production.</p>",
    "talk_lang": "RU",
    "talk_title": "Building an Offline first app with Persistence storage",
    "talk_description": "<p>My talk will be on the approach of offline first. This is something that has long been the norm on native platforms, but not very popular on the web. This will be about the experience of offline first at the architectural level using Web Worker and IndexedDB (with Lovefield SQL Engine).</p>",
    "twitter": "geek_timofey"
  },
  {
    "id": 10,
    "name": "Dima Korolev",
    "photo": "dima-korolev.jpg",
    "city": "Moscow, Russia",
    "intro": "<p>В разработке с младших классов школы, в команде Tinkoff.ru - c 2016 года. По образованию врач, по призванию зануда.</p>",
    "talk_lang": "RU",
    "talk_title": "Через тернии к ATM",
    "talk_description": "<p>В августе 2018 года Тинькофф Банк запустил собственную сеть банкоматов. Одна из задач, стоявших перед командой - разработка оригинального, понятного и удобного для клиентов интерфейса. Рассказ о том, как важно выбирать технологии исходя из условий, с какими проблемами мы столкнулись, как их можно было бы избежать, и что из этого всего вышло.</p> <p>1) Что собой представляет UI для банкоматов.<br>- Взаимодействие софта и железа внутри банкомата.<br>- Используемый стек технологий для разработки UI.<br>- Почему выбрали именно такой стек?<br><br>2) Какие проблемы мы испытывали и испытываем при разработке и тестировании.<br>- Тестирование.<br>- Релизы.<br>- Решение клиентских проблем, необычные случаи из жизни.<br><br>3) Что удалось сделать.<br>- Много различных банкоматов, моделей, функций.<br>- Немного об оптимизации инкассации за счет наших технологий.</p>",
    "twitter": ""
  },
  {
    "id": 11,
    "name": "Irina Levina",
    "photo": "irina-levina.jpg",
    "city": "Minsk, Belarus",
    "intro": "<p>A Frontend developer in Emerline. Irina can use coding as a meditation. Each day brings her a new inspiration in Frontend development, she hopes that it will never end, and she wants and tries to share it with other people.</p>",
    "talk_lang": "RU",
    "talk_title": "TBD",
    "talk_description": "<p>TBD</p>",
    "twitter": ""
  },
  {
    "id": 12,
    "name": "Kseniya Koltun",
    "photo": "kseniya-koltun.jpg",
    "city": "Minsk, Belarus",
    "intro": "<p>Head of UX/ Product Manager в стартапе https://facemetrics.io/, одного из известных белорусских стартапов в области дополненной реальности.\nДо стартапа Ксения более 10 лет работала в EPAM Systems, разрабатывая интерфейсы для заказчиков с мировым именем и руководя группой из 30 дизайнеров; выступила ментором Minsk Service Design Jam и докладчиком конференций «Деловой интернет», ProfsoUX, The Rolling Scopes.</p>",
    "talk_lang": "RU",
    "talk_title": "TBD",
    "talk_description": "<p>TBD</p>",
    "twitter": ""
  },
  {
    "id": 13,
    "name": "Alexander Shushunov",
    "photo": "alexander-shushunov.jpg",
    "city": "Tver, Russia",
    "intro": "<p>Alexander is a software developer at EPAM Systems. He has been writing code for 15 year. And he likes it. He started as a back-end developer, but 4 years ago he turned to other side. The front-end world is amazing and it is getting better every day. Being a part of it is very exciting.</p>",
    "talk_lang": "RU",
    "talk_title": "Svelte. Первый взгляд.",
    "talk_description": "<p>Рассказ о первом знакомстве с Svelte. Его основные особенности (что лежит в основе, основные концепции). Что нужно, чтобы написать первое приложение. Общие впечатления. Положительные и отрицательные стороны. Небольшое сравнение с React. </p> <p> Доклад начального уровня. Рассчитан на людей, которые давно слышали о фреймворке, но руки не доходили попробовать.</p>",
    "twitter": ""
  },
  {
    "id": 14,
    "name": "Nikita Sidorov",
    "photo": "nikita-sidorov.jpg",
    "city": "Moscow, Russia",
    "intro": "<p>В Маркете Никита занимается техническими проектами фронтенда, улучшая сервис как для самих разработчиков, так и для пользователей. Ручной рутине предпочитает рутину автоматизированную.</p>",
    "talk_lang": "RU",
    "talk_title": "Как не писать код самому: делегируем наши проблемы AST",
    "talk_description": "<p>Рассмотрим проблему автоматического тестирования интерфейсов, работающих на технологии React. Кратко пробежимся по основам использования AST на примере автогенерации селекторов для React-компонентов, используя библиотеку Reselector.</p>",
    "twitter": ""
  },
  {
    "id": 15,
    "name": "Shawn Wang",
    "photo": "shawn-wang.jpg",
    "city": "New York, United States",
    "intro": "<p><a target='_blank' href='https://twitter.com/swyx'>@swyx</a> is an Infinite Builder working on Developer Experience at Netlify. In his free time he helps people Learn in Public at Egghead.io and /r/reactjs.</p>",
    "talk_lang": "EN",
    "talk_title": "STAR Apps: Design Systems, TypeScript, Apollo GraphQL, and React",
    "talk_description": "A new front-end stack is emerging. They involve building Design Systems for visual consistency, using TypeScript for internal consistency, Apollo GraphQL for data manipulation, and server- or statically-rendered React for data representation. In this talk we explore how these trends fit together, and _why_ leading product teams from AirBnb to the New York Times are embracing them.",
    "workshop_title": "Workshop: JAMStack Jumpstart: Gatsby + Netlify",
    "workshop_description": "<p>There is a lot of developer and investment interest in JAMStack technologies: from the serverless movement to new authentication models to continuous atomic deployment to the static site generator renaissance. But with so many new terms and options, it is hard for people to figure out where to start.</p><p>This workshop will teach developers to set up a simple but state of the art Gatsby and Netlify stack, which lets people create blazing fast sites and apps with React and GraphQL, backed up by a continuous deployment and serverless platform complete with authentication and CMS. It has never been easier to get a great Lighthouse score, or to deploy complex, secure webapps for free.</p>",
    "twitter": "swyx"
  },
  {
    "id": 16,
    "name": "Sergey Shalyapin",
    "photo": "sergey-shalyapin.jpg",
    "city": "Minsk, Belarus",
    "intro": "<p>6-year front-end developer. Senior engineer at Oxagile. Really cross-platform developer making apps from native mobile applications up to TV apps using js-based technologies. Lecturer at EPAM js lab, mentor and lecturer at rolling scopes since it was started, who became streamer in fact :)</p>",
    "talk_lang": "EN",
    "talk_title": "What's wrong with classic education?!",
    "talk_description": "<p>What was new in terms of education tasks, how offline 30-person lectures grew up to thousand-viewers online webinars. How home tasks were updated. And what technologies are used to keep up the school.</p>",
    "twitter": ""
  },
  {
    "id": 17,
    "name": "Madlaina Kalunder",
    "photo": "madlaina-kalunder.jpg",
    "city": "Zurich, Switzerland",
    "intro": "<p>Madlaina is a full stack developer and a 3d graphics enthusiast on a mission to make 3d content accessible for people working on the web. She graduated at the Zurich University of Arts with a bachelor degree in Game Design, combining the passion for 3d and storytelling with the newest technologies.</p> <p>Currently, she researches XR technologies and 3D Human-Computer Interaction at the University of Applied Science Northwestern Switzerland. Madlaina believes in bringing people of different backgrounds together to solve problems in creative ways. </p>",
    "talk_lang": "EN",
    "talk_title": "Beyond Flatland - the rise of 3D user interfaces",
    "talk_description": "<p>As humans we use spatial<sup>*</sup> intelligence to navigate around the world, record information as mental models and to solve complex three-dimensional problems. Navigating virtual 3D content with common 2D interaction techniques has severe drawbacks regarding efficiency and ease of use. In this talk we will explore possibilities of using three-dimensional user interfaces which let the user interact with virtual objects, environments or information using direct 3D input in the physical or virtual space.</p><p>Seeing how complex 3D interaction concepts can be broken down to simpler problems will inspire web developers to get creative and consider creating spatial computing products with 3D web technologies. Get inspired to experiment with the techniques and explore the possibilities of the immersive web beyond flatland.</p><p><small><sup>*</sup>spatial stands for \"relating to or occupying space\"</small></p> <h3 class='padding-top-md'>Takeaways for the audience</h3><ul> <li>Introduction to 3D UI/UX and interaction techniques</li> <li>Exploration of 3D user interaction systems and device landscape</li>  <li>Opportunities of Collaboration in spatial computing</li> <li>Enhancing Immersion through Storytelling & Visual Narrative</li> <li>Human Factors in Natural User Interfaces</li> <li>Opportunities in immersive web applications</li> <li>cool demos</li></ul>",
    "twitter": "anialdam"
  }
]
