[
  {
    "id": 1,
    "name": "Alexander Gerasimov",
    "photo": "alexander-gerasimov.jpg",
    "city": "Berlin, Germany",
    "intro": "<p>Alex is employed as a front-end engineer at Wix.com, earning just enough to sustain his functional programming addiction.</p><p>In his spare time he teaches programming and creates educational games with his hacker friends.</p>",
    "talk_lang": "EN",
    "talk_title": "Talk TBD",
    "talk_description": "",
    "twitter": "da_quirm",
    "company": "wix.com"
  },
  {
    "id": 2,
    "name": "Andrei Lesnitsky",
    "photo": "andrei-lesnitsky.jpg",
    "city": "Minsk, Belarus",
    "intro": "<p>Andrei Lesnitsky - self-employed software dev. Passioned about front-end development, bleeding edge web-technologies, js performance, public speaking and knowledge sharing. Constantly experimenting with new stuff, messing around with pet projects for fun.</p>",
    "talk_lang": "EN",
    "talk_title": "Talk TBD",
    "talk_description": "",
    "twitter": "lesnitsky_a",
    "company": "Self-employed"
  },
  {
    "id": 3,
    "name": "Andre Gloukhmantchouk",
    "photo": "andre-gloukhmantchouk.jpg",
    "city": "Los Angeles, United States",
    "intro": "<p>Andre is Software Engineer at Google/YouTube monetization. Uses his spare time to keep up with ever-evolving Front End world. Loves snowboard, wakeboard, &lt;anything&gt;board.</p>",
    "talk_lang": "EN",
    "talk_title": "Talk TBD",
    "talk_description": "",
    "twitter": "",
    "company": "Google"
  },
  {
    "id": 4,
    "name": "Martin Splitt",
    "photo": "martin-splitt.jpg",
    "city": "Zürich, Switzerland",
    "intro": "<p>Martin is open source contributor and web evangelist by heart from Zurich with a decade experience from the trenches of software engineering in multiple fields.</p><p>He works as a developer advocate at Google and loves solving problems.</p><p> He devotes his time to moving the web forward, fixing problems, building applications and systems and breaking things for fun & profit.</p><p> Martin believes in the web platform and is working with bleeding edge technologies that will allow the web to prosper.</p>",
    "talk_lang": "EN",
    "talk_title": "Technical SEO for JS developers",
    "talk_description": "",
    "twitter": "g33konaut",
    "company": "Google"
  },
  {
    "id": 5,
    "name": "Kirill Knysh",
    "photo": "kirill-knysh.jpg",
    "city": "Amsterdam, The Netherlands",
    "intro": "<p>Kirill Knysh, Software Engineer at Uber Amsterdam, 9+ years of experience, including front end, back end, Set-Top-Box UI development, passionate to coding.</p>",
    "talk_lang": "EN",
    "talk_title": "React application as API",
    "talk_description": "",
    "twitter": "",
    "company": "Uber"
  },
  {
    "id": 6,
    "name": "Ilya Pukhalski",
    "photo": "ilya-pukhalski.jpg",
    "city": "Amsterdam, The Netherlands",
    "intro": "<p>Digital architect helping great brands launch not always great products. All-way JavaScript junkie, retired rock star, rym gat, beer drinker, hell raiser.</p>",
    "talk_lang": "EN",
    "talk_title": "Talk TBD",
    "talk_description": "",
    "twitter": "pukhalski",
    "company": "EPAM"
  },
  {
    "id": 7,
    "name": "Martin Woolley",
    "photo": "martin-woolley.jpg",
    "city": "London, United Kingdom",
    "intro": "<p>Martin Woolley works for the Bluetooth SIG, the technical standards body for Bluetooth. He’s an industry veteran with over 30 years’ experience working with computers large, small and ….. getting smaller. He still has a Sinclair ZX81 somewhere.<p><p>Martin is the Bluetooth SIG's Developer Relations Manager for the EMEA region and is responsible for informing, educating and supporting developers in the region.</p>",
    "talk_lang": "EN",
    "talk_title": "Creating IoT Applications with Web Bluetooth",
    "talk_description": "<p>10 million Bluetooth devices ship every day, and that figure is rising. Regarded as one of the key, enabling technologies of the Internet of Things (IoT), Bluetooth is everywhere and in the summer of 2017, a new Bluetooth technology, Bluetooth mesh networking was released. Bluetooth mesh is used in enterprise and industrial IoT systems and in these environments, web technologies and cloud-based architectures are king. </p><p>Web Bluetooth allows developers to create web applications which can monitor and control Bluetooth devices. In this session, we’ll review key Bluetooth concepts and capabilities and the Web Bluetooth APIs which let you exploit them. </p><p>There may even be demos!</p>",
    "twitter": "bluetooth_mdw",
    "company": "Bluetooth SIG"
  },
  {
    "id": 8,
    "name": "Alexander Saft",
    "photo": "alexander-saft.jpg",
    "city": "Moscow, Russia",
    "intro": "<p>Alexander is a Software Engineer at Lifestream. Building lots of different APIs helped him to know the other side of work with vary RDBMS and gave him experience to become a sous chef of DBA. Now he is a usual fullstack developer who paints buttons, but with knowledge about transaction isolation levels and ways to get half of database with one query in milliseconds. Likes to take pictures and to talk about photography, especially lifestyle and still life.</p>",
    "talk_lang": "RU",
    "talk_title": "Workshop: ORM without ORM",
    "talk_description": "<p>Every backend developer faces with the need to work with database. Usually it’s RDBMS and usually it’s ORM. And it’s convenient and works fine. Until the queries become monstrous. Because RDBMS allow and encourage to write complex queries, but the ORMs… ORMs don’t like anything non-standard. And developer finds himself between the hammer and the anvil: he has to write clean and neat code and he has to utilize advanced DBMS features to reach good performance. So, is there any way to do what we need to do and not to suffer? At the workshop we will search and will find the way to write pretty code and get enthusiastic glance from your DBA.</p>",
    "twitter": "AlSaft",
    "company": "Lifestream"
  },
  {
    "id": 9,
    "name": "Timofey Lavrenuyk",
    "photo": "timofey-lavrenuyk.jpg",
    "city": "Odessa, Ukraine",
    "intro": "<p>Timofey is a Software Engineer at Keepsolid. Mozilla Tech Speaker. 6+ years in web development. Interested in creating my own projects, testing new features and going into production.</p>",
    "talk_lang": "RU",
    "talk_title": "Building an Offline first app with Persistence storage",
    "talk_description": "<p>My talk will be on the approach of offline first. This is something that has long been the norm on native platforms, but not very popular on the web. This will be about the experience of offline first at the architectural level using Web Worker and IndexedDB (with Lovefield SQL Engine).</p>",
    "twitter": "geek_timofey",
    "company": "KeepSolid"
  },
  {
    "id": 10,
    "name": "Dima Korolev",
    "photo": "dima-korolev.jpg",
    "city": "Moscow, Russia",
    "intro": "<p>В разработке с младших классов школы, в команде Tinkoff.ru - c 2016 года. По образованию врач, по призванию зануда.</p>",
    "talk_lang": "RU",
    "talk_title": "Через тернии к ATM",
    "talk_description": "<p>В августе 2018 года Тинькофф Банк запустил собственную сеть банкоматов. Одна из задач, стоявших перед командой - разработка оригинального, понятного и удобного для клиентов интерфейса. Рассказ о том, как важно выбирать технологии исходя из условий, с какими проблемами мы столкнулись, как их можно было бы избежать, и что из этого всего вышло.</p> <p>1) Что собой представляет UI для банкоматов.<br>- Взаимодействие софта и железа внутри банкомата.<br>- Используемый стек технологий для разработки UI.<br>- Почему выбрали именно такой стек?<br><br>2) Какие проблемы мы испытывали и испытываем при разработке и тестировании.<br>- Тестирование.<br>- Релизы.<br>- Решение клиентских проблем, необычные случаи из жизни.<br><br>3) Что удалось сделать.<br>- Много различных банкоматов, моделей, функций.<br>- Немного об оптимизации инкассации за счет наших технологий.</p>",
    "twitter": "",
    "company": "Tinkoff"
  },
  {
    "id": 11,
    "name": "Irina Levina",
    "photo": "irina-levina.jpg",
    "city": "Minsk, Belarus",
    "intro": "<p>A Frontend developer in Emerline. Irina can use coding as a meditation. Each day brings her a new inspiration in Frontend development, she hopes that it will never end, and she wants and tries to share it with other people.</p>",
    "talk_lang": "RU",
    "talk_title": "TBD",
    "talk_description": "<p>TBD</p>",
    "twitter": "",
    "company": "LeverX Group"
  },
  {
    "id": 12,
    "name": "Kseniya Koltun",
    "photo": "kseniya-koltun.jpg",
    "city": "Minsk, Belarus",
    "intro": "<p>Head of UX/ Product Manager в стартапе https://facemetrics.io/, одного из известных белорусских стартапов в области дополненной реальности.\nДо стартапа Ксения более 10 лет работала в EPAM Systems, разрабатывая интерфейсы для заказчиков с мировым именем и руководя группой из 30 дизайнеров; выступила ментором Minsk Service Design Jam и докладчиком конференций «Деловой интернет», ProfsoUX, The Rolling Scopes.</p>",
    "talk_lang": "RU",
    "talk_title": "TBD",
    "talk_description": "<p>TBD</p>",
    "twitter": "",
    "company": "FaceMetrics"
  },
  {
    "id": 13,
    "name": "Alexander Shushunov",
    "photo": "alexander-shushunov.jpg",
    "city": "Tver, Russia",
    "intro": "<p>Alexander is a software developer at EPAM Systems. He has been writing code for 15 year. And he likes it. He started as a back-end developer, but 4 years ago he turned to other side. The front-end world is amazing and it is getting better every day. Being a part of it is very exciting.</p>",
    "talk_lang": "RU",
    "talk_title": "Svelte. Первый взгляд.",
    "talk_description": "<p>Рассказ о первом знакомстве с Svelte. Его основные особенности (что лежит в основе, основные концепции). Что нужно, чтобы написать первое приложение. Общие впечатления. Положительные и отрицательные стороны. Небольшое сравнение с React. </p> <p> Доклад начального уровня. Рассчитан на людей, которые давно слышали о фреймворке, но руки не доходили попробовать.</p>",
    "twitter": "",
    "company": "EPAM"
  },
  {
    "id": 14,
    "name": "Nikita Sidorov",
    "photo": "nikita-sidorov.jpg",
    "city": "Moscow, Russia",
    "intro": "<p>В Маркете Никита занимается техническими проектами фронтенда, улучшая сервис как для самих разработчиков, так и для пользователей. Ручной рутине предпочитает рутину автоматизированную.</p>",
    "talk_lang": "RU",
    "talk_title": "Как не писать код самому: делегируем наши проблемы AST",
    "talk_description": "<p>Рассмотрим проблему автоматического тестирования интерфейсов, работающих на технологии React. Кратко пробежимся по основам использования AST на примере автогенерации селекторов для React-компонентов, используя библиотеку Reselector.</p>",
    "twitter": "",
    "company": "Yandex"
  },
  {
    "id": 15,
    "name": "Shawn Wang",
    "photo": "shawn-wang.jpg",
    "city": "New York, United States",
    "intro": "<p><a target='_blank' href='https://twitter.com/swyx'>@swyx</a> is an Infinite Builder working on Developer Experience at Netlify. In his free time he helps people Learn in Public at Egghead.io and /r/reactjs.</p>",
    "talk_lang": "EN",
    "talk_title": "STAR Apps: Design Systems, TypeScript, Apollo GraphQL, and React",
    "talk_description": "A new front-end stack is emerging. They involve building Design Systems for visual consistency, using TypeScript for internal consistency, Apollo GraphQL for data manipulation, and server- or statically-rendered React for data representation. In this talk we explore how these trends fit together, and _why_ leading product teams from AirBnb to the New York Times are embracing them.",
    "workshop_title": "Workshop: JAMStack Jumpstart: Gatsby + Netlify",
    "workshop_description": "<p>There is a lot of developer and investment interest in JAMStack technologies: from the serverless movement to new authentication models to continuous atomic deployment to the static site generator renaissance. But with so many new terms and options, it is hard for people to figure out where to start.</p><p>This workshop will teach developers to set up a simple but state of the art Gatsby and Netlify stack, which lets people create blazing fast sites and apps with React and GraphQL, backed up by a continuous deployment and serverless platform complete with authentication and CMS. It has never been easier to get a great Lighthouse score, or to deploy complex, secure webapps for free.</p>",
    "twitter": "swyx",
    "company": "Netlify"
  },
  {
    "id": 16,
    "name": "Sergey Shalyapin",
    "photo": "sergey-shalyapin.jpg",
    "city": "Minsk, Belarus",
    "intro": "<p>6-year front-end developer. Senior engineer at Oxagile. Really cross-platform developer making apps from native mobile applications up to TV apps using js-based technologies. Lecturer at EPAM js lab, mentor and lecturer at rolling scopes since it was started, who became streamer in fact :)</p>",
    "talk_lang": "EN",
    "talk_title": "What's wrong with classic education?!",
    "talk_description": "<p>What was new in terms of education tasks, how offline 30-person lectures grew up to thousand-viewers online webinars. How home tasks were updated. And what technologies are used to keep up the school.</p>",
    "twitter": "",
    "company": ""
  },
  {
    "id": 17,
    "name": "Madlaina Kalunder",
    "photo": "madlaina-kalunder.jpg",
    "city": "Zurich, Switzerland",
    "intro": "<p>Madlaina is a full stack developer and a 3d graphics enthusiast on a mission to make 3d content accessible for people working on the web. She graduated at the Zurich University of Arts with a bachelor degree in Game Design, combining the passion for 3d and storytelling with the newest technologies.</p> <p>Currently, she researches XR technologies and 3D Human-Computer Interaction at the University of Applied Science Northwestern Switzerland. Madlaina believes in bringing people of different backgrounds together to solve problems in creative ways. </p>",
    "talk_lang": "EN",
    "talk_title": "Beyond Flatland - the rise of 3D user interfaces",
    "talk_description": "<p>As humans we use spatial<sup>*</sup> intelligence to navigate around the world, record information as mental models and to solve complex three-dimensional problems. Navigating virtual 3D content with common 2D interaction techniques has severe drawbacks regarding efficiency and ease of use. In this talk we will explore possibilities of using three-dimensional user interfaces which let the user interact with virtual objects, environments or information using direct 3D input in the physical or virtual space.</p><p>Seeing how complex 3D interaction concepts can be broken down to simpler problems will inspire web developers to get creative and consider creating spatial computing products with 3D web technologies. Get inspired to experiment with the techniques and explore the possibilities of the immersive web beyond flatland.</p><p><small><sup>*</sup>spatial stands for \"relating to or occupying space\"</small></p> <h3 class='padding-top-md'>Takeaways for the audience</h3><ul> <li>Introduction to 3D UI/UX and interaction techniques</li> <li>Exploration of 3D user interaction systems and device landscape</li>  <li>Opportunities of Collaboration in spatial computing</li> <li>Enhancing Immersion through Storytelling & Visual Narrative</li> <li>Human Factors in Natural User Interfaces</li> <li>Opportunities in immersive web applications</li> <li>cool demos</li></ul>",
    "twitter": "anialdam",
    "company": "FHNW University"
  },
  {
    "id": 18,
    "name": "Anton Bely",
    "photo": "anton-bely.jpg",
    "city": "Minsk, Belarus",
    "intro": "<p>Anton Bely is a Software Engineer at Yandex. He started as Java dev, but almost at the beginning turned to front-end and now feels better. Passioned about Front-End and Math. Strives to learn how things work. Touches ML for fun. Lecturer at Rolling Scopes School.</p>",
    "talk_lang": "RU",
    "talk_title": "Angular + Redux ... stop, what?",
    "talk_description": "<p>Now we can use Redux within Angular application with help of ngrx. I would like to talk about some useful tricks, which can help us to improve code readability, performance and make you feel better.</p>",
    "twitter": "",
    "company": "Yandex"
  },
  {
    "id": 19,
    "name": "Ekaterina Prigara",
    "photo": "ekaterina-prigara.jpg",
    "city": "Munich, Germany",
    "intro": "<p>Ekaterina is a Product Manager for the WebStorm IDE at JetBrains. As part of her job, and as a hobby, she follows all the new things going on in the JavaScript ecosystem, experiments with new tools, and tries to understand how WebStorm can help developers. She also loves music and coffee.</p>",
    "talk_lang": "RU",
    "talk_title": "How we develop WebStorm",
    "talk_description": "<p>We at the WebStorm team at JetBrains aim at making JavaScript developers more productive and happy. I will tell you about the IDE development process, how we decide what features will be implemented, and how users can help us with that and be involved in this process.</p>",
    "twitter": "katyaprigara",
    "company": "JetBrains"
  },
  {
    "id": 20,
    "name": "Muhammed Salih Guler",
    "photo": "muhammed-salih-guler.jpg",
    "city": "Berlin, Germany",
    "intro": "<p>Salih is a Berlin based Android Engineer who is a Google Developer Expert for Flutter and Dart. He likes sharing his knowledge with the people by mentoring aspiring developers, blogging and talking at conferences.</p>",
    "talk_lang": "EN",
    "talk_title": "Animations in Flutter",
    "talk_description": "<p>If you are into mobile development, you probably heard of Flutter. It's the new kid in the block and offers you a native cross-platform development environment.</p> <p>One of the biggest advertisements for the Flutter is \"You won't say no to your UI/UX designer anymore\" and one of the biggest reason for this is: Animations.</p> <p>In this talk we will go through, how you can create the widely used animations in Flutter by explaining the key concepts of it and of course, we will see some code :)</p>",
    "twitter": "salihgueler",
    "company": "Onefootball GmbH"
  },
  {
    "id": 21,
    "name": "Aleksandr Denisov",
    "photo": "aleksandr-denisov.jpg",
    "city": "Nizhny Novgorod, Russia",
    "intro": "<p>EPAM, Senior Software Engineer, Nizhny Novgorod</p><p>Founder of GDG Nizhny Novgorod</p><p>Co-Founder of the podcast  “Mobile People Talks”</p><p>Stack: Java, Microservices, Cloud, Firebase and Flutter of course</p><p>I’m experienced a lot in enterprise development, in IT for more than 15 years. I worked in the field of the nuclear industry, taxation, telecom. Recently, I specialized mainly in a microservice architecture, but now my main interest is Flutter. I’m a Flutter enthusiast and Co-Head of Flutter Competency in EPAM</p>",
    "talk_lang": "RU",
    "talk_title": "How to cook Flutter correctly",
    "talk_description": "<p>Flutter is a new mobile framework from Google, created for the development of applications for iOS and Android with the same codebase. SDK for cross-platform development allows developers to write applications in the Dart language and is designed to easily create a UI for both platforms.</p><p>Unfortunately, there is nothing in the documentation that looks like a guide to the recommended application architecture.</p><p>In the talk, I’ll talk about various typical architectures that can be used when developing on Flutter, their pros, and cons. And on one of them - BloC, we will stop in more detail.</p><p>BloC (Business Logic Component) is an architectural template presented by Google at the DartConf conference last year, based on the reactive paradigm, and in my opinion one of the most suitable for development on Flutter.</p>",
    "twitter": "ShuregDenisov",
    "company": "EPAM"
  },
  {
    "id": 22,
    "name": "Elaine Dias Batista",
    "photo": "elaine-dias-batista.jpg",
    "city": "Paris, France",
    "intro": "<p>Elaine works at SFEIR on mobile and voice technologies projects. She loves to share with the community her experiences about her favorite topics: Android, Google Assistant and Flutter.</p>",
    "talk_lang": "EN",
    "talk_title": "Google Assistant for Android developers",
    "talk_description": "<p>The fact that \"apps\" for the Google Assistant and for Android are both available on Android smartphones can be the cause of some confusion. Do I have to go to the Play Store to download and install an \"app\" for the Google Assistant? Can I launch a Google Assistant experience from an Android app? How to integrate advanced voice recognition (NLP or other) on existing apps? What experience should I offer on my app?  In this talk I will answer these questions, do a comparison of the ecosystems and how they can work together.</p>",
    "twitter": "elainedbatista",
    "company": "SFEIR"
  },
  {
    "id": 23,
    "name": "Vojtech Miksu",
    "photo": "vojtech-miksu.jpg",
    "city": "San Francisco, United States",
    "intro": "<p> I am an UI Platform Engineer at Uber who builds and maintains a component library called Base Web and various tooling around design systems. Let's find the best machanka place in Minsk and chat about open source, CSS in JS and React!</p>",
    "talk_lang": "EN",
    "talk_title": "What A Drag",
    "talk_description": "<p>\"Can we do this thing drag and droppable?\". That's one of the sentences that every front end developer fears the most. There are many DnD libraries out there but did you ever consider building something from scratch before adding additional 100kB to your bundle?</p><p>Let's take a look what tools browsers offer today. You can build beautiful and accessible experiences while supporting mobile devices and not sacrificing the performance! This talk is inspired by the recently released react-movable library.</p>",
    "twitter": "vmiksu",
    "company": "Uber"
  },
  {
    "id": 24,
    "name": "Richard Westenra",
    "photo": "richard-westenra.jpg",
    "city": "London, United Kingdom",
    "intro": "<p>I'm a London-based front-end dev from New Zealand with ten years of experience, specialising in interactive data-visualisation. I often work with React and D3, and am interested in accessibility, open web standards and usability.</p><p>I once won a \"Code in the Dark\" blind-coding competition, but I also once took down a client website overnight by deploying to the wrong endpoint at 5pm, so overall I reckon I'm breaking even.</p>",
    "talk_lang": "EN",
    "talk_title": "Painting with Data",
    "talk_description": "<p>Data-visualisation trades in metaphor and allusion. At its best, it’s imaginative storytelling with data and algorithms. We’ll explore how to create beauty with JavaScript, how dataviz can shape the way we see the world, and how you can get started painting with data.</p>",
    "twitter": "richardwestenra",
    "company": "QuantumBlack"
  },
  {
    "id": 25,
    "name": "Milica Mihajlija",
    "photo": "milica-mihajlija.jpg",
    "city": "Belgrade, Serbia",
    "intro": "<p>Milica is web developer from Belgrade, currently writing for Google about performance optimizations and tools that can help you with that. Before that she was an intern at Mozilla where she worked on Servo engine and learned a lot about how browsers work. She’s also a Mozilla Tech Speaker and a big believer in open web, always exploring new technologies that are moving it forward, like WebAssembly and WebVR.</p>",
    "talk_lang": "EN",
    "talk_title": "Fast future with WebAssembly",
    "talk_description": "<p>The web has come a long way from text pages with links, but the only language that you could use to build applications for it was JavaScript - until now.</p><p>WebAssembly is a new type of code that modern browsers can run and it's fast by design. You do not write WebAssembly, you compile other languages, like C++ or Rust, to WebAssembly. All major browsers support it and they are steadily working on adding new features.</p><p>If you just smile and nod at the mention of binary and compilation targets, this talk is for you. It will be your gentle guide into how WebAssembly works, why we need it and how you can benefit from it in your next project (even if you continue to work with JavaScript only). Exciting real-world applications and implications included.</p>",
    "twitter": "bibydigital",
    "company": "Mozilla TechSpeaker"
  },
  {
    "id": 26,
    "name": "Paul Yuhnovich",
    "photo": "paul-yuhnovich.jpg",
    "city": "Minsk, Belarus",
    "intro": "<p>Paul is a web developer, who happens to be several communities organizer, public speaker, mentor, traveler and just a guy with a good sense of humor. Currently lives in Minsk, but you can easily find him at any international conference.</p>",
    "talk_lang": "EN",
    "talk_title": "A universal fusion of the team",
    "talk_description": "<p>In a galaxy far, far away... Perhaps there is a team with high-quality processes, their communication proceeds without any problems and each team member speaks in the language that is understandable for everyone.</p><p>However, let's go back to our realities, where much still needs to be improved. To begin with, let's try to get rid of our (dev) accent to find a common language with the rest of the team.</p>",
    "twitter": "Paul_Yuhnovich",
    "company": "EPAM"
  },
  {
    "id": 27,
    "name": "Anastasiia Voitova",
    "photo": "anastasiia-voitova.jpg",
    "city": "Kyiv, Ukraine",
    "intro": "<p>Software engineer with a wide background, I started as a mobile developer. Then I focused on cryptography/applied security, now I'm building security tools for protecting data during the whole life cycle, not depending on a platform.</p><p>I maintain open source security libraries that allow developers to integrate encryption into their apps and infrastructures easily (currently 11 languages/platforms are supported), conduct secure software development training and workshops about building secure apps.</p><p>Recently used languages: Swift/ObjC, Go, C.</p>",
    "talk_lang": "EN",
    "talk_title": "10 lines of encryption, 1500 lines of key management",
    "talk_description": "<p>Often when users ask for some features, they don’t understand how long it takes to make them. When features are related to security, developers also often don’t understand how long it will take.</p><p>I will show the real case about one large note taking the app, that decided to implement convenient note encryption and note locking for their existing user base. But finding a balance between usability, security and mobile platforms' restrictions is complicated.</p><p>We will start with the security design scheme, then select the proper encryption library, then implement the flow, and prepare for incidents. Now — think about it — cryptography is only chapter 3 in OWASP MASVS (7 chapters in general). Even the best cryptography will fail if basic security controls are badly implemented.</p><p>Points we will go through the difference between \"locking\" and \"encrypting\", the difference between password and encryption key, how to sync passwords between devices, what exactly to store in keychain/keystore, how to use proper cryptography (AES CBC or AES GCM, random salt? IV? padding? what a hell is this mess), how to use biometrics (we don’t want to bother user, let’s use biometric keychain, but what if users will change their fingerprints — shall we invalidate all passwords?), updating encryption version (imagine, vulnerability is discovered in our library or app — how to update cipher, and softly migrate users to the new cipher, if users don’t even have a clue that encryption was versioned).</p><p>In the end, this is only one simple JIRA ticket \"let's encrypt the notes\" from the eyes of security software engineer :)</p>",
    "twitter": "vixentael",
    "company": "Cossack Labs"
  },
  {
    "id": 28,
    "name": "Vladimir Ivanov",
    "photo": "vladimir-ivanov.jpg",
    "city": "Saint-Petersburg, Russia",
    "intro": "<p>Vladimir Ivanov is a Mobile Solution Architect in EPAM Systems. Basically it means he designs software systems with focus on the mobile apps. Coming from Android background Vladimir is also proficient in React-Native and cloud technologies and incredibly passionate about sharing his knowledge.</p>",
    "talk_lang": "EN",
    "talk_title": "Wake Up, Neo",
    "talk_description": "<p>I believe most of us are just doing their day-to-day job and it's fine. But have you thought are we doing alright as an industry? Do we do things in a right way? Do we do the right things? Are there any flaws in what we are doing? Actually, there are! The security is not great generally speaking, the performance of our apps can be much better, the quality is below optimal and the emotional atmosphere is definitely not ideal. In this topic, I want to uncover those issues to give the current state of the industry and provide some tips on how we can improve it together. </p>",
    "twitter": "vvsevolodovich",
    "company": "EPAM"
  },
  {
    "id": 29,
    "name": "Artur Kenzhaev",
    "photo": "artur-kenzhaev.jpg",
    "city": "Moscow, Russia",
    "intro": "<p>Team Lead at Yandex, Yandex.Market Design System Lead Engineer.</p><p>Artur is obsessed with coding, music, drums and has Master Degree on Computational Linguistics. He's also passionate about software architecture, Type Systems and User/Application Interfaces. In his spare time, he looks for any ways to simplify complex things in the front end 😅</p>\n",
    "talk_lang": "EN",
    "talk_title": "The Quest of the Styling Graal",
    "talk_description": "<p>\"At Yandex.Market we have a lot of different products with a wide variety of User Interfaces, plenty of client-side experiments like A/B tests, and each service have requirements such as performance, caching, theming and so on. And we've tried many different approaches in order to build a unified Design System which can be used by any of our services.</p><p>So, there are dozens of ways to style React applications, from Plain CSS and CSS-Modules to styled-components. Each option has tradeoffs. Yet the following problems often remain overlooked: styles, markup semantics, and accessibility.</p><p>Shadow DOM and frameworks like Svelte or Vue have made a step towards scoped styles for tags and attributes. However, it is still absent in React.</p><p>I would like to talk about the history of different web-applications styling solutions, and share some ideas about framework-agnostic library reshadow (https://reshadow.dev), which provides the Shadow DOM Developer Experience, but for the Virtual DOM.</p><p>It is about a way to match styles of complex application state on the simple declarative CSS selectors for tags, Components, and props, with efficient runtime and compile-time processing.</p><p>Thus, the more semantic and accessible markup you write, the simpler selectors you get.</p><p>At last but not least, reshadow makes it easy to completely restyle any Component, which in combination with Dependency Injection opens up additional possibilities in theming and A/B testing without product-code changes.\"</p>",
    "twitter": "_lttb",
    "company": "Yandex.Market"
  },
  {
    "id": 30,
    "name": "Vitaly Friedman",
    "photo": "vitaly-friedman.jpg",
    "city": "Freiburg, Germany",
    "intro": "<p>Vitaly Friedman loves beautiful content and does not give up easily. From Minsk in Belarus, he studied computer science and mathematics in Germany, discovered the passage a passion for typography, writing and design. After working as a freelance designer and developer for 6 years, he co-founded <a href=\"http://smashingmagazine.com/\" target=\"_blank\">Smashing Magazine</a>, a leading online magazine dedicated to design and web development. Vitaly is the author, co-author and editor of all <a href=\"https://shop.smashingmagazine.com\" target=\"_blank\">Smashing books</a>. He currently works developing the new <a href=\"“https://www.smashingmagazine.com/membership“\" taget=\"_blank\">Smashing Memberships</a> around the globe!</p>",
    "talk_lang": "EN",
    "talk_title": "Privacy UX",
    "talk_description": "<p>Privacy UX Interfaces have become quite a character, haven't they? Self-indulgent, impolite and genuinely unlikeable. How often are you greeted with a wondrous permissions prompt craving to send you messages to the lock screen? What about onboarding cards you dismiss without reading? How about app notifications, streaming endlessly and loudly your way? And what about the infamous \"feedback\" or \"chat\" buttons floating on the sie? All these solutions desperately craving for our attention, yet as a result pushing customers away, often irrevocably. In this talk, Vitaly Friedman, co-founder of Smashing Magazine and creative lead and UX consultant, will explore better approaches for onboarding and offboarding, authentication patterns and infamous GDPR consent cookie prompts, annoying permission requests and disruptive notifications requests. Plus, we'll learn how to deal with nasty CAPTCHAs, social sign-ins, shady third-parties, shaky connectivity issues and a few general privacy issues that often cost conversion. You'll walk away with a toolbox of techniques applicable to any mobile project — be it a native app, PWA or a good ol' responsive website. Beware: you will not be able to unlearn what you'll learn in this session!</p>",
    "twitter": "smashingmag",
    "company": "Smashing Magazine"
  },
  {
    "id": 31,
    "name": "Scott Feinberg",
    "photo": "scott-feinberg.jpg",
    "city": "New York, United States",
    "intro": "<p>Scott currently works at Google, helping media customers utilize Google Cloud. Prior to Google, Scott led development for The New York Times Cooking website. </p>",
    "talk_lang": "EN",
    "talk_title": "Move Beyond Functions: Simple, Robust App Hosting with KNative and Google Cloud Run",
    "talk_description": "<p>We were led to believe that as frontends developers, if we wanted easy deployments, we needed to stick our code in a function. Since the birth of Lambda, the FaaS movement had been wildly popular. The problem is we ended up with a stack where we have a bunch of functions for one-offs, a single well maintained deployment path for our main application, and perhaps a mix legacy VMs running particular workloads. If we're lucky, our main deployment path is using K8S and has nice pipelines, but everything else is pretty ad-hoc.</p><p>This approach has been defended because why invest in all the work required to deploy to K8S for all those apps? It's a lot of yaml files after all.</p><p>But now there's a new approach. With Knative, you can easily deploy your scripts to a Kubernetes cluster with just a simple bit of configuration. No custom frameworks, just a vanilla container running your functions and applications.</p><p>Learn how Knative and Google Cloud Run are changing how frontend developers deploy code!</p>",
    "twitter": "",
    "company": "Google"
  },
  {
    "id": 32,
    "name": "Ioana Chiorean",
    "photo": "ioana-chiorean.jpg",
    "city": "Cluj Napoca, Romania",
    "intro": "<p>Ioana is a software engineer that has more than 9 years testing experience with a specialization in mobile apps. Currently located in Romania she is leading 4 teams in an outsourcing company. In her free time she contributes to Open Source projects while enjoying a coffee or a good wine. She is the Module Owner for Mozilla Reps and one of the MozTechSpeakers.</p>",
    "talk_lang": "EN",
    "talk_title": "How I learned testing from mobile browsers",
    "talk_description": "<p>Working on 5 mobile browsers app each with different focus might seem overwhelming. Ramping up people for such diverse testing might seem impossible. But as tom Cruise survived Mission Impossible, so did my team.</p>",
    "twitter": "ioana_cis",
    "company": "Cognizant Softvision / Mozilla"
  },
  {
    "id": 33,
    "name": "Artem Kunets",
    "photo": "artem-kunets.jpg",
    "city": "Moscow, Russia",
    "intro": "<p>Артем разрабатывает приложение с 3D-сценой в Align Technology и изучает возможности WebGL в браузере. В свободное время развивает свой движок для рендеринга. Считает, что 3D-графика даёт разработчику безграничные возможности для реализации его идей.</p>",
    "talk_lang": "RU",
    "talk_title": "Трассируем лучи в реальном времени",
    "talk_description": "<p>Я расскажу о способах рендеринга в реальном времени. Доклад делится на две части, в первой части будет рассказано о рендеринге с помощью растеризации, а также о том, что с ней не так. Вторая часть доклада посвящена рендерингу с помощью трассировки лучей и тому какие возможности это для нас открывает. Я буду использовать технологию NVIDIA RTX и соответствующее расширение Vulkan API, примеры кода на Node.js. Доклад дает представление о том, как можно начать разрабатывать собственный трассировщик лучей используя Javascript уже сегодня.</p>",
    "twitter": "",
    "company": "Align Technology"
  },
  {
    "id": 34,
    "name": "Alexander Blinov",
    "photo": "alexander-blinov.jpg",
    "city": "Moscow, Russia",
    "intro": "<p>Александр занимается Android-разработкой с 2011 года. В настоящий момент руководит Android направлением в группе компаний Headhunter.  </p><p>Увлекается технологизацией  и оптимизацией процессов в разработке ПО и проектированием архитектурных решений. Спикер многих конференций, в том числе Dump, Droidcon, Appsconf, Mobius. </p><p>Один из ведущих Android Dev Podcast. Соавтор и технический евангелист MVP фреймворка Moxy.</p>",
    "talk_lang": "RU",
    "talk_title": "Молчание джунов",
    "talk_description": "<p>\"Сижу я такой, пишу код быстрее всех в компании, чувствую себя супер сеньором. Сходил на собес, а меня спросили непонятно что, а потом позвонила hr и сказала, что я не ОК. Обидненько\". На другой стороне баррикад: \"Не можем найти разрабов уже год. Техлид завалил двадцать кандидатов подряд – сказал, что не ОК. Бизнес буксует, команда работает по 80 часов в неделю\".</p><p>Знакомая ситуация? На докладе мы посмотрим на процесс собеседования и построения плана индивидуального развития с разных сторон, проанализируем ошибки, а потом вместе с вами запилим шаблон для собеса, и протестируем его боем.</p>",
    "twitter": "xanderblinov",
    "company": "Headhunter"
  },
  {
    "id": 35,
    "name": "Pavel Strelchenko",
    "photo": "pavel-strelchenko.jpg",
    "city": "Moscow, Russia",
    "intro": "<p>Разрабатываю под Android с 2015 года. В hh.ru занимаюсь поддержкой основных приложений, а также разработкой внутренних инструментов. Интересуюсь разработкой плагинов под Android Studio, вопросами архитектуры приложений, нейронными сетями. Участвовал в Android Academy MSK в качестве ментора и лектора.</p>",
    "talk_lang": "RU",
    "talk_title": "Фантастические плагины и где они обитают",
    "talk_description": "<p>Каждый разработчик сталкивается с желанием автоматизировать часть своей работы. Но далеко не каждый пишет для этого собственный плагин для Android Studio или IntelliJ IDEA, потому что думает, что это сложно.</p><p>В докладе я докажу, что разработать плагин — подъёмная задача для любого разработчика.</p><p>Я расскажу, как в hh.ru сделали плагин для создания feature-модулей: почему решили написать именно плагин и почему не подошли существующие решения генерации кода, с какими проблемами сталкивались и как их решали. Раскрою несколько секретов плагиностроения: что такое PSI, как создавать собственные wizard-диалоги и как использовать встроенный DI. А также покажу исходники и расскажу, что в них поменять для решения ваших задач.</p><p>Доклад будет интересен как тем, кто никогда не писал плагины, так и тем, кто только начал в них разбираться.</p>",
    "twitter": "",
    "company": "Headhunter"
  },
  {
  "id": 36,
  "name": "Vladik Khononov",
  "photo": "vladik-khononov.jpg",
  "city": "Nazareth Iliit, Israel",
  "intro": "<p>Vladik (Vlad) Khononov is a software engineer with 20 years of industry experience. During the years, he worked for companies large and small, in roles ranging from Webmaster to Chief Architect. </p><p>Vladik maintains an active media career as a public speaker, a blogger, and an author. Vlad is a regular speaker at leading software engineering conferences — O’Reilly Software Architecture, NDC, DDD Europe, and others — where he speaks on Distributed Systems, Domain-Driven Design, Microservices, and software architecture in general.</p><p>As an author, Vlad participated in the “Domain-Driven Design: The First 15 Years” book project, alongside Martin Fowler, Mel Conway, Rebecca Wirfs-Brock, and other industry leaders.</p>",
  "talk_lang": "RU",
  "talk_title": "Testing Software Architecture",
  "talk_description": "<p>If anything, the Agile, Lean, and DevOps movements have proven that software architecture is not a “one man show”. Instead, in order to succeed, software design is a group effort that requires involvement from different stakeholders. In this session I’d like to talk about the testing aspect of software architecture and design.</p><p>We will see what exactly is this “important stuff”, that we use to call software architecture; what are its goals, and what differentiates a good architecture from a bad one? Next, we will discuss how to watch over a system’s architecture during the various stages of its development:</p><ul><li>The differences between under and over-engineering</li><li>How to identify forming of a “big ball of mud” in early stages</li><li>What are the symptoms of an exhausted architecture that is breaking under its own weight</li></ul><p>Ultimately, I’ll demonstrate how such tests can be automated using static code analysis tools.</p>",
  "twitter": "vladikk",
  "company": "Invesus Group"
},
  {
    "id": 37,
    "name": "Yonatan Levin",
    "photo": "yonatan-levin.jpg",
    "city": "Tel Aviv, Israel",
    "intro": "<p>Йонатан — один из ведущих израильских мобильных разработчиков, часть элитной команды Google Developer Experts. Сыграл ключевую роль в успехе Gett, собравшем более 500 миллионов долларов, а также получил финансирование своего стартапа KolGene, набирающего популярность генетического market connector-а. Будучи верным приверженцем мобильного и продукт-менеджмента, Йонатан также с большим энтузиазмом занимается бэкендом. Как состоявшийся разработчик и предприниматель, он точно знает, как превратить умные идеи в прибыльный продукт.</p>",
    "talk_lang": "EN",
    "talk_title": "TBD",
    "talk_description": "<p>TBD</p>",
    "twitter": "parahall",
    "company": "monday.com"
  },
  {
    "id": 38,
    "name": "Venkat Dinavahi",
    "photo": "venkat-dinavahi.jpg",
    "city": "Berlin, Germany",
    "intro": "<p>CTO of Turtle, helping freelance devs find interesting remote work. Freelance dev himself in a previous life. Currently exploring technologies and architectures that increase developer productivity in distributed teams.</p>",
    "talk_lang": "EN",
    "talk_title": "Distributed Architectures for Distributed Teams",
    "talk_description": "<p>In a dev team distributed across multiple timezones, you have many challenges:  coordination, keeping a maintainable codebase, and moving fast. You will get an overview of some architectural patterns that address these problems.</p>",
    "twitter": "",
    "company": "Turtle Inc"
  },
  {
    "id": 39,
    "name": "Denis Artyuhovich",
    "photo": "denis-artyuhovich.jpg",
    "city": "London, United Kingdom",
    "intro": "<p></p>",
    "talk_lang": "EN",
    "talk_title": "How to set up a pipeline with visual unit tests for your application",
    "talk_description": "<p>During this talk, we’ll discuss why we bet on visual unit tests. On a real example, we’ll discover how to implement such tests for React application with Jest and Puppeteer, we’ll meet Allure report with Jest and in the end, set up the full pipeline with CircleCi and GitHub to run our own visual tests on each pull request. Also, we’ll consider performance and some tricky parts (eg. how to integrate it with BrowserStack in case if you need cross-browser testing).</p><p>Demo project and draft presentation available here: https://github.com/zaqqaz/visual-unit-tests</p>",
    "twitter": "",
    "company": "DAZN"
  },
  {
    "id": 40,
    "name": "Alexey Bykov",
    "photo": "alexey-bykov.jpg",
    "city": "Moscow, Russia",
    "intro": "<p>Алексей занимается Android-разработкой с 2016 года, успел поработать в аутсорсе, стартапах и крупных компаниях. В данный момент разрабатывает Kaspersky Secure Connection и Kaspersky Security Cloud. Увлекается мобильным UX'ом. Организатор и лектор сообщества Android Academy MSK, выступал на MOSDROID и AppsConf</p>",
    "talk_lang": "RU",
    "talk_title": "UX как область ответственности мобильного разработчика",
    "talk_description": "<p>Мы часто говорим об удобстве разработки для программиста: “Архитектура, Многомодульность, чистый код…”. </p><p>Несмотря на это, не так много приложений могут похвастаться действительно хорошо реализованным UX’ом в проекте.</p><p>Поговорим о том, как мы можем менять в лучшую сторону UX приложения с минимальными затратами, и почему это не только задача дизайнера.</p>",
    "twitter": "hungry_moose",
    "company": "KasperskyLab"
  },
  {
    "id": 41,
    "name": "Dmitriy Movchan",
    "photo": "dmitriy-movchan.jpg",
    "city": "Moscow, Russia",
    "intro": "<p></p>",
    "talk_lang": "RU",
    "talk_title": "Автотесты под Android - так ли это просто?",
    "talk_description": "<p>Очень многие сегодня хотят внедрить автотесты в свои проекты. Многие неправильно оценивают сложность внедрения, расценивая эту задачу как простую. Однако приходит суровая реальность и на автотесты приходится потратить намного больше времени, чем ожидалось. Так в чем же дело? Давайте разберемся вместе на моем докладе. </p>",
    "twitter": "",
    "company": "KasperskyLab"
  }
]
